/* 
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
/**
 * Author:  udgin
 * Created: 28.11.2017
 */
INSERT INTO public.clients ("id", "code", "name", "note", "status") 
VALUES 
(1, 'КЛ1', 'Коля', 'Отличный заказчик', 'Работает'), 
(2, 'КЛ2', 'Вася Брянск', 'Хороший заказчик', 'Работает'), 
(3, 'КЛ3', 'Петя Смоленск', 'Плохой заказчик', 'Работает'); 

INSERT INTO public.orders ("number", "note", "status", "client_id", "due_time", "amount") 
VALUES 
('1001', 'Первый заказ', 'Черновик', 1, '2017-12-31 10:00:00', 20000), 
('1002', 'Второй заказ', 'Черновик', 1, '2017-12-31 10:00:00', 24000), 
('1003', 'Третий заказ', 'Черновик', 1, '2017-12-31 10:00:00', 4000),
('1004', 'Первый заказ', 'Черновик', 2, '2017-12-31 10:00:00', 50000), 
('1005', 'Второй заказ', 'Черновик', 2, '2017-12-31 10:00:00', 32000), 
('1006', 'Третий заказ', 'Черновик', 2, '2017-12-31 10:00:00', 23400),
('1007', 'Первый заказ', 'Черновик', 2, '2017-12-31 10:00:00', 20000), 
('1008', 'Второй заказ', 'Черновик', 2, '2017-12-31 10:00:00', 40000), 
('1009', 'Третий заказ', 'Черновик', 2, '2017-12-31 10:00:00', 60000),
('1010', 'Первый заказ', 'Черновик', 3, '2017-12-31 10:00:00', 20000), 
('1011', 'Второй заказ', 'Черновик', 3, '2017-12-31 10:00:00', 10000), 
('1012', 'Третий заказ', 'Черновик', 3, '2017-12-31 10:00:00', 10000),
('1013', 'Второй заказ', 'Черновик', 3, '2017-12-31 10:00:00', 13000), 
('1014', 'Третий заказ', 'Черновик', 3, '2017-12-31 10:00:00', 24000),
('1015', 'Первый заказ', 'Черновик', 3, '2017-12-31 10:00:00', 28000), 
('1016', 'Второй заказ', 'Черновик', 3, '2017-12-31 10:00:00', 22000), 
('1017', 'Третий заказ', 'Черновик', 3, '2017-12-31 10:00:00', 21000);


